list2 = {  "q1": ["برنامه نویسی به چه صورتی کار می‌کند؟",' برنامه نویسی به صورت نوشتن کدهای کامپیوتری است که توسط کامپیوتر قابل فهم و اجرا می‌باشند. برنامه نویسان با استفاده از زبان‌های برنامه نویسی مختلف، الگوریتم‌ها و ساختارهای داده، کدهایی را ایجاد می‌کنند که وظایف خاصی را انجام می‌دهند.'],
          "q2": ["زبان برنامه نویسی مناسب برای شروع چیست؟",' زبان برنامه نویسی مناسب برای شروع بستگی به علاقه و هدف شما دارد. اما برخی از زبان‌های محبوب برای شروع شامل Python، JavaScript و Ruby است. این زبان‌ها ساده و قابل فهم هستند و به شما درک مفاهیم برنامه نویسی را آسان می‌کنند.'],
          "q3": ["چگونه یک برنامه‌نویس حرفه‌ای شوم؟",' برای تبدیل شدن به یک برنامه‌نویس حرفه‌ای، شما باید به صورت مداوم تمرین کنید و پروژه‌های عملی را انجام دهید. همچنین، از منابع آموزشی معتبر استفاده کرده و با تکنولوژی‌های جدید و روش‌های به روز آشنا شوید.'],
          "q4": ["چگونه برنامه‌نویسی را به عنوان یک شغل شروع کنم؟",'برای شروع برنامه‌نویسی به عنوان یک شغل، اولین قدم این است که یک زبان برنامه نویسی را یاد بگیرید و پروژه‌های عملی را انجام دهید. همچنین، می‌توانید در دوره‌های آموزشی محلی یا آموزشگاه‌های آنلاین ثبت نام کنید تا مفاهیم پایه را یاد بگیرید.'],
          "q5": ["چگونه می‌توانم با استفاده از آموزش‌های آنلاین برنامه‌نویسی را یاد بگیرم؟",' استفاده از آموزش‌های آنلاین یک روش مؤثر برای یادگیری برنامه‌نویسی است. شما می‌توانید از منابع آموزشی معتبر مانند Coursera، Udemy و Codecademy استفاده کنید. همچنین، وبسایت‌ها و منابع آموزشی رایگان مانند W3Schools و MDN Web Docs نیز مفید هستند.'],
          "q6": ["چطور می‌توانم با پروژه‌های کوچک برنامه‌نویسی تمرین کنم؟",' یک راه خوب برای تمرین برنامه نویسی انجام پروژه‌های کوچک است. شروع با پروژه‌های ساده و تدریجاً به پروژه‌های پیچیده تر پیش بروید. همچنین، می‌توانید به سایت‌های مسابقات برنامه نویسی مانند HackerRank و LeetCode مراجعه کنید و تمرین کنید.'],
          "q7": [" آیا برای شروع برنامه‌نویسی نیاز به دانش ریاضی عالی دارم؟",'برای شروع برنامه نویسی، نیاز به دانش ریاضی عالی ندارید. در حقیقت، بسیاری از مفاهیم ریاضیات در زبان‌های برنامه نویسی پیاده سازی شده است و شما با تمرکز بر روش حل مسائل و تفکر الگوریتمی موفق خواهید شد.'],
          "q8": ["چگونه می‌توانم در جامعه برنامه‌نویسان فعال شوم؟",' برای فعال شدن در جامعه برنامه‌نویسان، می‌توانید در جلسات کاربردی و کارگاه‌های حضور داشته باشید، در گروه‌های برنامه نویسان در شبکه‌های اجتماعی عضو شوید و در همایش‌ها و کنفرانس‌های مختلف شرکت کنید.'],
          "q9": ["چطور می‌توانم از منابع آنلاین و کتاب‌ها برای یادگیری برنامه‌نویسی استفاده کنم؟",' استفاده از منابع آنلاین و کتاب‌ها یک راه خوب برای یادگیری برنامه نویسی است. شما می‌توانید از منابع آموزش آنلاین مثل Udemy، Coursera و edX استفاده کنید. همچنین، کتاب‌های معتبر در زمینه برنامه نویسی را مطالعه کنید.'],
          "q10": ["چطور می‌توانم از منابع آنلاین و کتاب‌ها برای یادگیری برنامه‌نویسی استفاده کنم؟",'برای عضو شدن در گروه‌ها و انجمن‌های برنامه نویسان در اینترنت، می‌توانید در سایت‌های معروف مثل Stack Overflow، GitHub و Reddit عضو شوید. همچنین، در شبکه‌های اجتماعی مخصوص برنامه نویسان مانند LinkedIn گروه‌های مختلف را جستجو کنید و به آن‌ها بپیوندید.'],
          
          }
start_text = """مجموئی ما تحت اونوان مدرسی برنامن ویسی ددکانی تقریباً پنوز ده ساله که درخوزهی برنامن نویسی داره فعالیت می کنه. یعنی پنوز ده ساله ما شرکت برنامن ویسی سبت شده داریم. تیم برنامن ویسی داریم. تو این مدد تو نستیم تیداد زیادی از پروجهای داخلی و خارج از کشفر رو برنامن kویسی بکنیم.  

و هم اکنون داریم هم بخارج از کشفر کار می کنیم. هم پروجهای داخلی رو داریم هندل می کنیم. و این جوری بگیم که کاریمون برنامن ویسیه و این توی آموزش خیلی مهمه. شعاریمون اینه که برنامن ویسی رو از برنامن ویسی یاد بگیر. 

یعنی بر خلاف خیلی از آموزش که ها که بستر آموزشیشون, میتوده آموزشیشون برای روی یه سری مفاهمه تیوری و آکادمی که. یعنی که چون خودشون تجربه ای در برنامن ویسی تجاری ندارن. بنابرای این بسنده می کنن به یه کتاب به یه جزوه روی وایت بورد برنامن ویسی رو میان به شکل آکادمی که تدریس می کنن. 

در حالی که مزیت برنامن ویسی در کار عملیشه در پروجه ای انجام شدنشه. خب طبیییی هم هست آموزش که کارش پروجه گرفتن نباشه."""

kid_and_adult_dis = '''درس اجباری در تمامی مدارس پیشرفت ای دونیا تدریس می‌شه و همین امر مهر تهیدی بر اهمیت یاد گریه برنام نمیسی به ری کودکان و نو جوانان چون طبیهی اگه موضوع مهمی نبود که بچه‌ها از همون سنین پاین برنام نمیسی رو یاد بگیرن اگه این موضوع مهم نبود طبیهی اتن وارد مدارس پیشرفت ای دونیا نمی‌شه علاوه بر این برنام نمیسی می‌تونه به حل مسائل ریازی و منطقی دانش‌آموز کمک بکنه یعنی هتو این دلائیلی که علاوه می‌ینه بایست روشت بچه در مدرسته و تحسیل و درسه دانش که‌ها می‌شه یعنی کودنیویسی به حل مسائل ریازی و منطقی کمک می‌کنه به بهبود مهارت‌های نوشتاری کمک می‌کنه'''
caption_voice='کومک می کنه به زندگی تحسیلی دانشان موز. و این مورد ارس کردم. دلیده شن اینکه اگه این مورد مغایرت داشت با تحسیل بچه ها هیچ وخورد مدرسه پیشرفته دنیا نمیشو. این از بود بحبود فردی و زندگی اشتمایی و تحسیلی دانشان موز.' 

caption_voice2='میتوده آموزشی مدرسی ورنامانیو سی دود کنی. دستان ما در 24 ترم یعنی دو سال آموزشی ورنامانیو سی میدیم به کودکان 6 تا 16 سال. یعنی به کودکان و نوجوانان 6 تا 16 سال در 24 ترم که هر ترمی من. یک ماه شامل 8 جلسه هست 7 ای 2 جلسه بر گزار میشه و هر جلسه ام زمانش یک ساعته. '

kid_and_adult_dis2='''حالا چی چیز های رو یاد میگ ترراهی اپلیکیشن درحیقات موبایل هست بعد اون سی تر میان پایتون میخونن سی ترم هم پایتون میخونن این شد یک سال اول که تبدیل به یک برنامونی ویسی عمومی میشن که پشنیازه برای یک سال دوفوم دا ایغر مثل پیزش که عمومی میشن 
'''          
Darbare='''
مجموئی ما تحت اونوان مدرسی برنامن ویسی ددکانی تقریباً پنوز ده ساله که درخوزهی برنامن ویسی داره فعالیت می کنه. یعنی پنوز ده ساله ما شرکت برنامن ویسی سبت شده داریم. تیم برنامن ویسی داریم. تو این مدد تو نستیم تیداد زیادی از پروجهای داخلی و خارج از کشفر رو برنامن ویسی بکنیم.  

و هم اکنون داریم هم بخارج از کشفر کار می کنیم. هم پروجهای داخلی رو داریم هندل می کنیم. و این جوری بگیم که کاریمون برنامن ویسیه و این توی آموزش خیلی مهمه. شعاریمون اینه که برنامن ویسی رو از برنامن ویسی یاد بگیر. 

یعنی بر خلاف خیلی از آموزش که ها که بستر آموزشیشون, میتوده آموزشیشون برای روی یه سری مفاهمه تیوری و آکادمی که. یعنی که چون خودشون تجربه ای در برنامن ویسی تجاری ندارن. بنابرای این بسنده می کنن به یه کتاب به یه جزوه روی وایت بورد برنامن ویسی رو میان به شکل آکادمی که تدریس می کنن. 
در حالی که مزیت برنامن ویسی در کار عملیشه در پروجه ای انجام شدنشه. خب طبیییی هم هست آموزش که کارش پروجه گرفتن نباشه.'''
ReservedTime="""وقت های رزرو شده شما"""